fio/fio_ceph_randwrite_write_only/librbd/ceph_log/fio_write_08k.log
rbd_image0: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=rbd, iodepth=64
fio-3.1
Starting 1 process

rbd_image0: (groupid=0, jobs=1): err= 0: pid=123117: Fri Aug  3 16:41:16 2018
  write: IOPS=5190, BW=40.5MiB/s (42.5MB/s)(10.0GiB/252547msec)
    slat (usec): min=2, max=805, avg= 4.81, stdev= 6.10
    clat (msec): min=8, max=698, avg=12.15, stdev= 6.69
     lat (msec): min=8, max=699, avg=12.15, stdev= 6.69
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   10], 10.00th=[   11], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   12], 50.00th=[   12], 60.00th=[   13],
     | 70.00th=[   13], 80.00th=[   14], 90.00th=[   15], 95.00th=[   15],
     | 99.00th=[   18], 99.50th=[   19], 99.90th=[   39], 99.95th=[   56],
     | 99.99th=[  112]
   bw (  KiB/s): min= 8192, max=49152, per=100.00%, avg=41606.90, stdev=3195.55, samples=504
   iops        : min= 1024, max= 6144, avg=5200.84, stdev=399.45, samples=504
  lat (msec)   : 10=10.34%, 20=89.28%, 50=0.32%, 100=0.03%, 250=0.01%
  lat (msec)   : 750=0.01%
  cpu          : usr=2.83%, sys=0.25%, ctx=52689, majf=0, minf=8578
  IO depths    : 1=1.6%, 2=3.1%, 4=6.2%, 8=12.5%, 16=25.0%, 32=50.0%, >=64=1.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=98.5%, 8=0.0%, 16=0.0%, 32=0.0%, 64=1.5%, >=64=0.0%
     issued rwt: total=0,1310720,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=40.5MiB/s (42.5MB/s), 40.5MiB/s-40.5MiB/s (42.5MB/s-42.5MB/s), io=10.0GiB (10.7GB), run=252547-252547msec

Disk stats (read/write):
    dm-0: ios=0/1064, merge=0/0, ticks=0/6978, in_queue=6978, util=0.27%, aggrios=0/1059, aggrmerge=0/11, aggrticks=0/6969, aggrin_queue=6968, aggrutil=0.27%
  sdc: ios=0/1059, merge=0/11, ticks=0/6969, in_queue=6968, util=0.27%